<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"71930a62817ddc0ecb77519691d475f88af0c7c6a79f1ee12ac0d85cc99ba789","plan_job_ref":"Job Create terraform plan for Palo Alto Panorama Add-on #26 at https://github.com/AFMPE/mpe_palo_alto/actions/runs/7670900785","plan_hash":"79269aa969b7b9b1c1c9d722cb0e77e7bd65246228efa2c825906fa12beb9999","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh9df3erta
container_name=paloalto            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
jumpbox_vm_admin_password         = (sensitive value)
panorama_vm_admin_ssh_private_key = (sensitive value)
panorama_vm_admin_ssh_public_key  = (sensitive value)
production_subscription_id        = (sensitive value)
spoke_subscription_id             = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault_secret.panorama-server-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-server-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "Panorama-Server-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_network_interface.secondary_nic[0] will be created
  + resource "azurerm_network_interface" "secondary_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = []
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "ampe-eus-panorama-jmpbox-prod-sec-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ampe-eus-id-prod-rg"
      + tags                          = {
          + "ResourceName" = "ampe-eus-panorama-jmpbox-prod-sec-nic"
          + "deployedBy"   = "AzureNoOpsTF [default]"
          + "env"          = "prod"
          + "workload"     = "panorama"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig-vmsecondarynicipconfig1"
          + primary                                            = true
          + private_ip_address                                 = "10.8.9.230"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "**********************************************************************************************************************************************************************************************"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan for Palo Alto Panorama Add-on #26](https://github.com/AFMPE/mpe_palo_alto/actions/runs/7670900785)